src/wsman_solredir_disable

<?xml version="1.0" encoding="utf-8"?><Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.w3.org/2003/05/soap-envelope"><Header><Action xmlns="http://schemas.xmlsoap.org/ws/2004/08/addressing">http://schemas.xmlsoap.org/ws/2004/09/transfer/Put</Action><To xmlns="http://schemas.xmlsoap.org/ws/2004/08/addressing">http://192.168.0.100:16992/wsman</To><ResourceURI xmlns="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd">http://intel.com/wbem/wscim/1/amt-schema/1/AMT_RedirectionService</ResourceURI><MessageID xmlns="http://schemas.xmlsoap.org/ws/2004/08/addressing">af382d42-dceb-425f-a6bd-477208d4ba78</MessageID><ReplyTo xmlns="http://schemas.xmlsoap.org/ws/2004/08/addressing"><Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</Address></ReplyTo><OperationTimeout xmlns="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd">PT60.000S</OperationTimeout><wsman:SelectorSet xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"><wsman:Selector Name="CreationClassName">AMT_RedirectionService</wsman:Selector><wsman:Selector Name="Name">Intel(r) AMT Redirection Service</wsman:Selector><wsman:Selector Name="SystemCreationClassName">CIM_ComputerSystem</wsman:Selector><wsman:Selector Name="SystemName">Intel(r) AMT</wsman:Selector></wsman:SelectorSet></Header><Body><g:AMT_RedirectionService xmlns:g="http://intel.com/wbem/wscim/1/amt-schema/1/AMT_RedirectionService"><g:CreationClassName>AMT_RedirectionService</g:CreationClassName><g:ElementName>Intel(r) AMT Redirection Service</g:ElementName><g:EnabledState>32770</g:EnabledState><g:ListenerEnabled>false</g:ListenerEnabled><g:Name>Intel(r) AMT Redirection Service</g:Name><g:SystemCreationClassName>CIM_ComputerSystem</g:SystemCreationClassName><g:SystemName>Intel(r) AMT</g:SystemName></g:AMT_RedirectionService></Body></Envelope>
